NextFOAM-2401/tutorials/lagrangian/reactingParcelFoam/liquidFilmStepWithSprinklers/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

runParallel -s decompose redistributePar -decompose

runParallel makeFaMesh

runParallel $(getApplication)

runParallel -s reconstruct redistributePar -reconstruct

#------------------------------------------------------------------------------
